Revit 2026 API

# FillPatternTarget Enumeration

---

The type of the fill pattern.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum FillPatternTarget
```
```vb
Public Enumeration FillPatternTarget
```
```cpp
public enum class FillPatternTarget
```
```fsharp
type FillPatternTarget
```

| Member name | Value | Description |
| --- | --- | --- |
| Drafting | 0 | Represents a material in symbolic form. |
| Model | 1 | Represents an actual element appearance on a building. |
| None | 2 |  |

#### Reference

Autodesk.Revit.DB Namespace